app/controllers/api/pages_controller.rb

INSERT INTO "pages" ("content", "created_at", "published_on", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "test page content"], ["created_at", Tue, 24 Jul 2012 17:22:28 UTC +00:00], ["published_on", nil], ["title", "test page title"], ["updated_at", Tue, 24 Jul 2012 17:22:28 UTC +00:00]]
---
  def create
    @page = Page.new(params[:page])
    respond_to do |format|
      if @page.save

SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @page = Page.find(params[:id])